MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX130F064D.atdf
         <register caption="" name="REFCLKIR" offset="0xb4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="REFCLKIR" />
         </register>
      </register-group>
   </module>
   <module caption="" id="01423" name="RPOUT" version="">
      <register-group name="RPOUT">
         <register caption="" name="RPA0R" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPA0R" />
         </register>
         <register caption="" name="RPA1R" offset="0x4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPA1R" />
         </register>
         <register caption="" name="RPA2R" offset="0x8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPA2R" />
         </register>
         <register caption="" name="RPA3R" offset="0xc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPA3R" />
         </register>
         <register caption="" name="RPA4R" offset="0x10" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPA4R" />
         </register>
         <register caption="" name="RPA8R" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPA8R" />
         </register>
         <register caption="" name="RPA9R" offset="0x24" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPA9R" />
         </register>
         <register caption="" name="RPB0R" offset="0x2c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB0R" />
         </register>
         <register caption="" name="RPB1R" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB1R" />
         </register>
         <register caption="" name="RPB2R" offset="0x34" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB2R" />
         </register>
         <register caption="" name="RPB3R" offset="0x38" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB3R" />
         </register>
         <register caption="" name="RPB4R" offset="0x3c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB4R" />
         </register>
         <register caption="" name="RPB5R" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB5R" />
         </register>
         <register caption="" name="RPB6R" offset="0x44" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB6R" />
         </register>
         <register caption="" name="RPB7R" offset="0x48" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB7R" />
         </register>
         <register caption="" name="RPB8R" offset="0x4c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB8R" />
         </register>
         <register caption="" name="RPB9R" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB9R" />
         </register>
         <register caption="" name="RPB10R" offset="0x54" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB10R" />
         </register>
         <register caption="" name="RPB11R" offset="0x58" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB11R" />
         </register>
         <register caption="" name="RPB13R" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB13R" />
         </register>
         <register caption="" name="RPB14R" offset="0x64" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB14R" />
         </register>
         <register caption="" name="RPB15R" offset="0x68" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB15R" />
         </register>
         <register caption="" name="RPC0R" offset="0x6c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC0R" />
         </register>
         <register caption="" name="RPC1R" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC1R" />
         </register>
         <register caption="" name="RPC2R" offset="0x74" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC2R" />
         </register>
         <register caption="" name="RPC3R" offset="0x78" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC3R" />
         </register>
         <register caption="" name="RPC4R" offset="0x7c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC4R" />
         </register>
         <register caption="" name="RPC5R" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC5R" />
         </register>
         <register caption="" name="RPC6R" offset="0x84" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC6R" />
         </register>
         <register caption="" name="RPC7R" offset="0x88" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC7R" />
         </register>
         <register caption="" name="RPC8R" offset="0x8c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC8R" />
         </register>
         <register caption="" name="RPC9R" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC9R" />
         </register>
      </register-group>
   </module>
   <module caption="" id="00748" name="RTCC" version="1">
      <register-group name="RTCC">
         <register caption="RTC Control Register" name="RTCCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="RTCC Output Enable bit" mask="0x00000001" name="RTCOE" values="RTCCON__RTCOE" />
            <bitfield caption="Half-Second Status bit" mask="0x00000002" name="HALFSEC" values="RTCCON__HALFSEC" />
            <bitfield caption="RTCC Value Registers Read Synchronization bit" mask="0x00000004" name="RTCSYNC" values="RTCCON__RTCSYNC" />
            <bitfield caption="RTC Value Registers Write Enable bit" mask="0x00000008" name="RTCWREN" values="RTCCON__RTCWREN" />
            <bitfield caption="RTCC Clock Enable Status bit" mask="0x00000040" name="RTCCLKON" values="RTCCON__RTCCLKON" />
            <bitfield caption="RTCC Seconds Clock Output Select bit" mask="0x00000080" name="RTSECSEL" values="RTCCON__RTSECSEL" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="RTCCON__SIDL" />
            <bitfield caption="RTCC On bit" mask="0x00008000" name="ON" values="RTCCON__ON" />
            <bitfield caption="RTC Drift Calibration bits" mask="0x03FF0000" name="CAL" values="RTCCON__CAL" />
         </register>
         <register caption="RTC ALARM Control Register" name="RTCALRM" offset="0x10" rw="RW" size="4">
            <bitfield caption="Alarm Repeat Counter Value bits" mask="0x000000FF" name="ARPT" values="RTCALRM__ARPT" />
            <bitfield caption="Alarm Mask Configuration bits" mask="0x00000F00" name="AMASK" values="RTCALRM__AMASK" />
            <bitfield caption="Alarm Sync bit" mask="0x00001000" name="ALRMSYNC" values="RTCALRM__ALRMSYNC" />
            <bitfield caption="Alarm Pulse Initial Value bit" mask="0x00002000" name="PIV" values="RTCALRM__PIV" />
            <bitfield caption="Chime Enable bit" mask="0x00004000" name="CHIME" values="RTCALRM__CHIME" />
            <bitfield caption="Alarm Enable bit" mask="0x00008000" name="ALRMEN" values="RTCALRM__ALRMEN" />
         </register>
